Revit 2024 API
BuiltInFailures.ExternalResourceReferenceFailures.ReferenceToLocalFile Property
 The External Resource refers to a local file that may not be available to workshared users.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ReferenceToLocalFile { get; }
Visual Basic
Public Shared ReadOnly Property ReferenceToLocalFile As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ReferenceToLocalFile {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ExternalResourceReferenceFailures Class
Autodesk.Revit.DB Namespace